Revit 2027 API
ParameterTypeId.AnalyticalSpace Property
 "Analytical Space"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalSpace { get; }
Public Shared ReadOnly Property AnalyticalSpace As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalSpace {
	ForgeTypeId^ get ();
}
static member AnalyticalSpace : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace